# Создать вручную список, содержащий цены на товары (10–20 товаров), например:
# [57.8, 46.51, 97, ...]
#
# Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп (например
# «5 руб 04 коп»). Подумать, как из цены получить рубли и копейки, как добавить нули, если, например, получилось 7
# копеек или 0 копеек (должно быть 07 коп или 00 коп). Вывести цены, отсортированные по возрастанию, новый список не
# создавать (доказать, что объект списка после сортировки остался тот же). Создать новый список, содержащий те же
# цены, но отсортированные по убыванию. Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров
# по возрастанию, написав минимум кода?

from random import uniform


def prn(data):
    for n in data:
        print(n.split('.')[0], 'руб.,', n.split('.')[1], 'коп.', end='; ')
    print()


s_price = list()
for i in range(21):
    s_price.append(str(round(uniform(1, 100), 2)))
prn(s_price)
print(id(s_price))
s_price.sort()
prn(s_price)
print(id(s_price))
rew_price = s_price.copy()
rew_price.reverse()
prn(rew_price)
prn(rew_price[0:4])
